{
    "Ninja costume": {
        "name": "Ninja costume",
        "desc": "During the day you would normally be disguised as a traveller, beggar or suchlike. At night when on a mission, you would wear this costume. This consists of a few pieces of black cloth. One piece is worn as a jacket covering the chest and arms, two others are wound around each leg and held in at the waist. Finally, a long piece of cloth is wrapped around the head, leaving only the eyes exposed. The reverse side of the costume can be white, for travel on snowy ground or green, for travel in woods or grasslands.",
        "start": true
    },
    "Breathing tube": {
        "name": "Breathing tube",
        "desc": "Made from bamboo, this can be used as a snorkel allowing you to remain under water for long periods of time. It can also be used as a blow-pipe in conjunction with the Poison Needles skill, for added range.",
        "start": true
    },
    "Iron sleeves": {
        "name": "Iron sleeves",
        "desc": "Sewn into the sleeves of your costume are four thin strips of iron, the length of your forearm. These allow you to parry or block blows from swords and other cutting weapons.",
        "start": true
    },
    "Garotte": {
        "name": "Garotte",
        "desc": "A specialised killing tool of the Ninja, this is a length of wire used to assassinate enemies by strangulation.",
        "start": true
    },
    "Flash powder": {
        "name": "Flash powder",
        "desc": "This powder, when thrown in any source of flame, causes a blinding flash.",
        "start": true
    },
    "Flint and tinder": {
        "name": "Flint and tinder",
        "desc": "Used for making fires.",
        "start": true
    },
    "Spiderfish": {
        "name": "Spiderfish",
        "desc": "Salted and cured, this highly venomous fish is used as a source for the deadly poison used in conjuntion with the Poison Needles skill, and as a useful way of removing any guardian beasts.",
        "start": true
    },
    "Blood of Nil": {
        "name": "Blood of Nil",
        "desc": "The most virulent poison known on Orb. This venom is extremely difficult and very dangerous to collect for it is taken from the barb of a scorpion son of the God, Nil, Mouth of the Void.",
        "start": true
    },
    "Shuriken": {
        "name": "Shuriken",
        "desc": "Razor sharp start-shaped discs of metals, thrown at targets to devasting effect."
    },
    "Opal ring": {
        "name": "Opal ring",
        "desc": "A ring given to you by the Grandmaster of the Dawn."
    },
    "Gold coin": {
        "name": "Gold coin",
        "desc": "A small golden coin."
    },
    "Healing potion": {
        "name": "Healing potion",
        "desc": "A small bottle of clear blue liquid, able to restore up to ten Endurance points."
    },
    "Gauntlet of Striking": {
        "name": "Gauntlet of Striking",
        "desc": "A black leather gauntlet sewn with delicate silver thread, it carries the virtue of magic."
    },
    "Crystal Amulet": {
        "name": "Crystal Amulet",
        "desc": "This amulet is a bright crystal set in a gold disk which carries an inscription, as well as magical runes: 'My wearer can withstand the Finger of Death'."
    },
    "Enchanted Shuriken": {
        "name": "Enchanted Shuriken",
        "desc": "A magical rune has been etched upon this Shuriken with acid, imbuing it with the power of Fate."
    }
}
