[
{"name": "Shurikenjutsu", "desc": "The skill of throwing razor sharp start-shaped discs of metal called 'Shuriken' up to about 30 feet, to deadly effect."},
{"name": "Arrow Cutting", "desc": "Requiring excellent muscular co-ordination, hand and eye judgement and reflexes, this skill enables you to knock aside, or even catch, missiles such as arrows or spears."},
{"name": "Acrobatics", "desc": "The ability to leap and jump using flips, cartwheels etc. like a tumbler or gymnast."},
{"name": "Immunity to Poisons", "desc": "This involves taking small doses of virulent poisons over long penods of time, slowly building up the body’s resistance. This enables the Ninja to survive most poisoning attempts."},
{"name": "Feigning Death", "desc": "Requiring long and arduous training, a Ninja with this ability is able to slow down his heart rate and metabolism through willpower alone, thus appearing to be dead."},
{"name": "Escapology", "desc": "A Ninja with this skill is able to dislocate the joints of the body and to maximise the body’s suppleness, allowing movement through small spaces and escape from bonds and chains by slipping out of them."},
{"name": "Poison Needles", "desc": "Sometime known as spitting needles, a Ninja with this skill can place small darts, coated with a powerful poison that acts in the blood stream onto his tongue. By curling the tongue into an 'O' shape and spitting or blowing, the dart can be propelled up to an effective range of about 15 feet. A useful surprise attack, the source of which is not always perceptible."},
{"name": "Picking Locks", "desc": "The ability to open locked doors, chests etc. A Ninja with this skill would carry various lockpicks in the pockets of his costume, including a small crowbar or jemmy. You are also trained to notice traps and to use the lock-picking tools to disarm them."},
{"name": "Climbing", "desc": "Comprehensive training in the use of a grappling hook and hand and foot damps, or Cat's Claws. The padded four-pronged hook has 40 feet of rope attached to it. Used to hook over walls, niches etc., allowing the Ninja to pull himself up the rope. The Cat's Claws are spiked clamps, worn over the palm of the hand and the instep of the feet, enabling the Ninja to imbed his Claws into a wall and climb straight up like a fly, and even to crawl across ceilings."}
]
