{
    "1": {
        "image": "1.png",
        "options": [
            {
                "prereq": null,
                "text": "Feint a punch and then use the Leaping Tiger kick?",
                "entry": 17,
                "type": "offence",
                "action": "kick"
            },
            {
                "prereq": null,
                "text": "Pretend to grapple but instead use the Cobra Strike jab?",
                "entry": 35,
                "type": "offence",
                "action": "punch"
            },
            {
                "prereq": null,
                "text": "Raise your foot as if to kick but side-step and use the Whirlpool throw?",
                "entry": 61,
                "type": null
            },
            {
                "prereq": [
                    "skill",
                    "Acrobatics"
                ],
                "text": "[Acrobatics] Somersault to Gorobei's side before attacking?",
                "entry": 80,
                "type": null
            }
        ],
        "description": "The dawn rays of the sun greet you as you begin your preparations for the time of trial. Today you will become the youngest ever to challenge for the title of Grandmaster of the Five Winds. When your foster father, Naijishi, was murdered by Yaemon, the second Grandmaster stepped into his place. Now, many seasons later another of the Grandmasters has died and the position is open once more for there must always be five who lead the order. You have been invited to challenge for it because of your consummate mastery of the Way of the Tiger.\n\nAt the appointed hour you walk, alone, across the sands to the Temple of the Rock. It is a huge pillared hall built into the side of an enormous boulder of red granite brought to rest on the Island of Tranquil Dreams by the ice floes of the age of snow, which carved out the Great Valley Reaches of the far north. As you approach the Temple, you see that the monks and a large number of villagers have assembled to watch the combat between you and the other challenger, Gorobei.\n\nLike you, Gorobei is an Initiate of the Inner Circle, a devout worshipper of Kwon and a capable fighter. He is older, heavier and stronger than you and has been unsuccessful in one previous challenge, but he is a skillful wrestler. You walk into the Temple and bow to the Grandmaster of the Dawn, a man who looks younger than his fifty years, slim and taut with piercing dark eyes. Beside you, Gorobei also bows, his face a mask showing no emotion. He is clad only in a loin cloth and his rippling muscles gleam with an oil that will make it difficult to keep a grip on him. You must defeat him in unarmed combat in order to be allowed to undertake the spiritual test which will show whether you are ready to become a Grandmaster.\n\nGorobei turns to you and bows and you return the courtesy. The Grandmaster of the Dawn reminds you that this is not a fight to the death and you may not use Inner Force. He signals for you to begin. Gorobei advances warily across the polished granite floor, his big hands ready to grapple you.",
        "opponents": [
            "Gorobei"
        ]
    },
    "17": {
        "image": "1.png",
        "opponent_offence": "punch",
        "player_defence": 7,
        "victory": 110,
        "defeat": 95,
        "options": [
            {
                "prereq": null,
                "text": "Feint and punch?",
                "entry": 35,
                "type": "offence",
                "action": "punch",
                "inner_force": false
            },
            {
                "prereq": null,
                "text": "Feint and throw?",
                "entry": 61,
                "type": null
            },
            {
                "prereq": null,
                "text": "Kick again?",
                "entry": 17,
                "type": "offence",
                "action": "kick",
                "inner_force": false
            }
        ],
        "description": "You step forward as if to punch, then, leaping in the air you lash the ball of your foot toward Gorobei's head with a speed that defies belief. Gorobei, although not quick, knows your style of combat."
    },
    "35": {
        "image": "1.png",
        "opponent_offence": "punch",
        "player_defence": 7,
        "defeat": 95,
        "victory": 110,
        "options": [
            {
                "prereq": null,
                "text": "Feint and kick?",
                "entry": 17,
                "type": "offence",
                "action": "kick",
                "inner_force": false
            },
            {
                "prereq": null,
                "text": "Feint and throw?",
                "entry": 61,
                "type": null
            },
            {
                "prereq": null,
                "text": "Punch again?",
                "entry": 35,
                "type": "offence",
                "action": "punch",
                "inner_force": false
            }
        ],
        "description": "You crouch as if to wrestle with Gorobei who tenses, ready to throw his extra weight against yours, but you jab unexpectedly towards his midriff. Gorobei's reach is long and he is skilled in punching and blocking, though he is not as fast as you."
    },
    "61": {
        "image": "1.png",
        "options": [
            {
                "prereq": null,
                "text": "Continue",
                "entry": 95,
                "type": "move"
            }
        ],
        "description": "You raise your foot as if to kick Gorobei in the chest, but spin to his side instead and take hold of his arm to throw him over your hip. You rapidly learn your mistake, however, as your grip slides on the oil which covers him and he uses his skill as a wrestler to grab you and lock your arm behind your back whilst he grips you around the throat. His strength is enormous. You try to somersault backwards over him and break the grip but he is ready for you and pins you to the floor before delivering a heavy blow."
    },
    "80": {
        "image": "1.png",
        "description": "You step forward to attack but then somersault suddenly, landing at Gorobei's side as his fist flails the air at the spot from which you leapt. He turns but you have surprised him and will find it easier to attack him than if you merely stood before him to trade blows.",
        "attack_modifier": 2,
        "options": [
            {
                "prereq": null,
                "text": "Feint a punch and then use the Leaping Tiger kick?",
                "entry": 17,
                "type": "offence",
                "action": "kick",
                "inner_force": false
            },
            {
                "prereq": null,
                "text": "Pretend to grapple but instead use the Cobra Strike jab?",
                "entry": 35,
                "type": "offence",
                "action": "punch",
                "inner_force": false
            },
            {
                "prereq": null,
                "text": "Raise your foot as if to kick but side-step and use the Whirlpool throw?",
                "entry": 61,
                "type": null
            }
        ]
    },
    "95": {
        "opponent_remove": "Gorobei",
        "options": [
            {
                "prereq": null,
                "text": "Continue",
                "entry": 191,
                "type": null
            }
        ],
        "description": "Gorobei has used the Iron Fist, punching you so hard in the back of the neck that you slump to the granite floor, senseless. A young village boy is pouring water onto your forehead when you regain your wits. A few of the younger acolytes murmur condolences as you rub your neck. An hour later, Gorobei returns from the robing chamber and you applaud with the others as he is ordained as a Grandmaster."
    },
    "110": {
        "description": "Your last blow sent Gorobei tumbling senseless to the granite floor. A ripple of applause greets your victory and the Grandmaster of the Dawn compliments you on your fighting prowess and beckons you into the robing chamber. You step beyond the Temple Hall through silken drapes into a small dark room, completely bare of furnishing save for two enormous copper chests. Incense is burning in a censer which swings from the ceiling like a pendulum. The room is lit by white candles.\n\nYou kneel on the rush matting facing the three Grandmasters who stare ahead, unseeing, waiting for you to break the silence which you are determined to keep. After an hour-candle has sputtered its last, during which time none of you has moved so much as a muscle, the Grandmaster of the Dawn looks into your eyes and says, 'Kwon knows that you desire in your heart to serve him but I must ask you two questions. Do you truly desire to serve Kwon above all other things or do you desire to avenge the death of your foster-father, Naijishi, more even than to serve your God? What should a Ninja fear most - the failure of a mission or capture by an enemy who will use torture to gain secrets?'\n\nYou know that in your heart of hearts you would rather avenge Naijishi than anything else in Orb but a Grandmaster should dedicate his life to Kwon. As for the second question, you can only let your good sense guide you.",
        "options": [
            {
                "prereq": null,
                "text": "'I desire to serve Kwon above all else and I fear only the failure of a mission.'",
                "entry": 139,
                "type": null
            },
            {
                "prereq": null,
                "text": "'I desire to avenge the father who loved me and I fear torture above all.'",
                "entry": 151,
                "type": null
            },
            {
                "prereq": null,
                "text": "'I desire to avenge the father who loved me and I fear only the failure of a mission.'",
                "entry": 177,
                "type": null
            },
            {
                "prereq": null,
                "text": "'I desire to serve Kwon above all else and I fear torture above all.'",
                "entry": 128,
                "type": null
            }
        ]
    },
    "128": {
        "description": "The Grandmaster shakes his head.\n\n'You have answered neither truthfully nor wisely. You cannot hide your wish to avenge Naijishi who loved you and taught you to love our Lord Kwon, from we who have known you near all of your short life. It is not wrong that you should wish to avenge Naijishi but you must wait patiently for your time to come and never forget that the service of Kwon is the helping of all mankind. As for torture, it is only through failing a mission that a true Ninja could be captured and there is always time to bite one's tongue from one's head and bleed to death rather than risk betraying secrets. You need fear only the failure of a mission. You have failed the spiritual test and you are not yet worthy to become Grandmaster of the Five Winds. Go back to the Temple Hall and ask Gorobei to come in to us.'\n\nDejectedly, you return to the main temple and there is a low moan from the villagers as you ask Gorobei to go into the robing room. He places his arm on your shoulder and says, 'Next time,' before moving past the silken curtain. An hour later he returns and you applaud with the others as he is ordained as a Grandmaster.",
        "options": [
            {
                "prereq": null,
                "text": "Continue",
                "entry": 191,
                "type": null
            }
        ]
    },
    "139": {
        "description": "The Grandmaster smiles and shakes his head.\n\n'You have answered cleverly but not truthfully. You cannot hide your wish to avenge Naijishi, who loved you and taught you to love our Lord Kwon, from we who have known you near all of your short life. It is not wrong that you should wish for revenge on Yaemon but wait patiently for your time to come and never forget that the service of Kwon is the helping of all mankind. You are right, though, to say that a Ninja need only fear failure, for to endure torture one must first endure failure. There is always time to bite one's tongue from one's head and bleed to death rather than risk betraying secrets under torture. I shall not say that you have failed, rather you are like a whetted blade straining in the sheath needing only the wisdom of years to hone you to perfection. I shall not keep such a potent weapon sheathed - you have passed the test.'\n\nThey lead you back to the Temple Hall where the monks and villagers have waited to see whether you would pass the test. Prayers to Kwon are offered up as part of the ceremony at which you are ordained as Grandmaster of the Five Winds. Gorobei applauds with the others. For now he remains an Adept of the Inner Circle but his time will come for he is a great warrior and a good monk. Should you die he will probably take your place.",
        "options": [
            {
                "prereq": null,
                "text": "Continue",
                "entry": 191,
                "type": null
            }
        ]
    },
    "151": {
        "description": "The Grandmaster smiles and shakes his head.\n\n'You have answered truthfully. It is not wrong that you should wish to avenge Naijishi, who loved you and taught you to love our Lord Kwon, but you must wait patiently for your time to come and never forget that the service of Kwon is the helping of all mankind. But as for torture, it is only through failing a mission that a true Ninja could be captured and there is always time to bite one's tongue from one's head and bleed to death rather than risk betraying secrets. You need only fear the failure of a mission. I shall not say that you have failed, for never has one mastered the Way of the Tiger so ably as you and we would not keep our sharpest weapon forever sheathed. You have passed the test.'\n\nThey lead you back to the Temple Hall where the monks and villagers have waited to see whether you would pass the test. Prayers to Kwon are offered up as part of the ceremony at which you are ordained as Grandmaster of the Five Winds. Gorobei applauds with the others, for now he remains an Adept of the Inner Circle but his time will come for he is a great warrior and a good monk. Should you die, he will probably succeed you.",
        "options": [
            {
                "prereq": null,
                "text": "Continue",
                "entry": 191,
                "type": null
            }
        ]
    },
    "177": {
        "description": "The Grandmaster of the Dawn smiles and says,\n\n'You pass the test for you have answered both truthfully and rightly. It is not wrong that you should wish to avenge Naijishi who loved you and taught you to love our Lord Kwon but you must wait patiently for your time to come and never forget that the service of Kwon is the helping of all mankind. It is only through failing a mission that a true Ninja would be captured and there is always time to bite off one's tongue from one's head and bleed to death rather than risk betraying secrets under torture.'\n\nHe continues, 'We have never seen one who shows such promise nor one who has mastered so ably the Way of the Tiger. I am going to recite to you the secret litany of the Ninja Grandmaster - remember it, for one day it may be of use to you.'\n\n> I AM NINJA  \nMy parents are the Heaven and the Earth  \nMy Home is my Body  \nMy Power is Loyalty  \nMy Magic is Training  \nMy Life and my Death is Breathing  \nMy Body is Control  \nMy Eyes are the Sun and the Moon  \nMy Ears are Sensitivity  \nMy Laws are Self-Protection  \nMy Strength is Adaptability  \nMy Ambition is taking every Opportunity with Fullness  \nMy Friend is my Mind  \nMy Enemy is Carelessness  \nMy Protection is Right Action  \nMy Weapons are Everything that Exists  \nMy Strategy is One Foot in front of the Other  \nMy Trust is in Kwon  \nMY WAY IS THE WAY OF THE TIGER\n\nHis words are etched in your memory. Next, he pulls an Opal Ring from his finger and passes it to you. 'This may be of use to you,' he says and you slip it onto your own finger. When the echoing words of the Grandmaster have died away they lead you back to the Temple Hall where the monks and villagers have waited to see whether you would pass the test. Prayers to Kwon are offered up as part of the ceremony at which you are ordained as a Grandmaster of the Five Winds. Gorobei applauds with the others. For now he remains an Adept of the Inner Circle but his time will come, for he is a great warrior and a good monk. Should you die he will probably take your place.",
        "loot_add": ["Opal ring"],
        "note_add": ["Litany of Dawn"],
        "event_add": ["ordained_grandmaster_of_five_winds"],
        "options": [
            {
                "prereq": null,
                "text": "Continue",
                "entry": 191,
                "type": null
            }
        ]
    },
    "191": {
    "description": "After the ceremony you all file out of the temple onto the golden sands and there is a frugal feast of rice and fruits shared by the villagers and the monks. You eat sparingly and take your leave early, wishing to meditate before you sleep. Relaxed from the meditation which frees your spirit from the shackles of your aching body your eyes close as soon as you lay yourself down on the straw-filled sacking that is your bed. You drift into a deep but troubled sleep.\n\nYou see a sleek-oared ship setting sail from the Land of Plenty. A tall, resolute-looking man is on the high stern castle, his legs braced against the swell. He wears a thick cloak of dark green against the weather and the sun flashes so vividly on the buckle of his sword belt that you believe this is not a dream but a vision. A sailor calls him by name, 'Glaivas', and he turns to look at you but then the vision fades and the brilliant blue sky is replaced by sombre purple clouds against which a large and dark castle looms. Three turrets on a great black Keep seem to pierce the douds. You are walking towards it, bent on completing a difficult and important mission.\n\nWhen ou awake you remember the dreams as if they were pictures painted on the wall of your monastic cell, but your sleep has at least restored any Endurance you lost in your contest with Gorobei. You are walking towards the Temple when there is a commotion on the beach and two fishermen run up to you with the news that a ship is riding at anchor offshore. A man rows himself to the beach and steps out, as the Grandmasters walk to the strand to greet him. He introduces himself as Glaivas and, bowing respectfully, he asks to talk to the Grandmaster of Grandmasters.\n\n'You may address us all,' says the Grandmaster of the Dawn, 'for we have no secrets on the Island of Tranquil Dreams.'\n\n'Not since you lost the Scrolls of Kettsuin,' Glaivas returns darkly.\n\n'What do you know of the Scrolls of Kettsuin?', asks the Grandmaster. The monks wait tensely as Glaivas looks around carefully before replying.\n\n'The Scrolls of Kettsuin hold the secret to the Word of Power which will bind Kwon himself in Inferno if it is spoken at the Pillars of Change in the great snow-wastes of the north. Yaemon, Grandmaster of Flame, of the order of the Scarlet Mantis stole it from you many years ago and he has deciphered the Word. It is the month of All-Mother Splendour and for three days the moon will turn red during the Great Conjunction of the Planets - something that occurs only once every five hundred years. If the Word is spoken by the Pillars of Change at this time your God, Kwon, will be imprisoned in the bottomless pit of fire, leaving the monks who worship Vile free to spread their dominion over the lands of men.'\n\nAt the mention of Yaemon's name there is uproar but as Glaivas continues an unnatural quiet descends.\n\n'Yaemon is preparing to set out even now from the city of Doomover on the long journey to the Ice Wastes. Though a Ranger long used to patrolling the wilderness on the edge of the Rift, I am no match for such as he. Is there one among you who will try to stop him?'\n\nAs Glaivas spoke you felt the burning need to be revenged on Yaemon flare within your breast. Your dream of Glaivas, for it was he you saw astride the deck of the ship which now rides at anchor near the sands, has convinced you that you are destined for this quest and you step forward saying, 'I  shall stop him.'\n\n'You are young,' says Glaivas, 'Can you succeed where I, a Ranger Lord, would fail?'\n\n'I am Ninja,' you reply.\n\nGlaivas starts. The Grandmaster of the Dawn sighs and says, 'Yes, I rename you Avenger, for if anyone can succeed, and you must for the sake of all mankind, it will be you.' With that he turns towards the Temple, and prayer.\n\nThe city of Doomover lies on the western coast of the Manmarch and Glaivas gifts you a map which shows the many cities and strange lands which stretch north to the snow wastes. You spend the rest of the day preparing, lacing the iron sleeves to your dark hued costume and gathering together the tools of the Ninja, before spending some hours in quiet meditation. You board Glaivas' ship in time to sail on the evening tide. You must find Yaemon and kill him before he reaches the Pillars of Change or all will be lost.",
    "heal_player": 20,
    "options": [
        {
            "prereq": null,
            "text": "Continue",
            "entry": 232,
            "type": null
        }
    ]
},
    "death": {
        "description": "You have been killed before completing your quest and recovering the Scrolls of Kettsuin.\n\n[Start a new game](/#/new-game).",
        "options": []
    }
}
